[
    {
        "tema": "Негизги плата – бул компьютердин ичиндеги негизги басма схемасы, анда компьютер системасынын ар кандай компоненттери жана түзүлүштөрү жайгаштырылган жана бири-бири менен иштешет. Бул процессор, оперативдүү эс, видеокарта, катуу диск жана башка түзүлүштөрдүн ортосундагы байланышты жана өз ара аракеттенүүнү камсыз кылган борбордук элемент.",
        "name": "Негизги плата",
        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/nagizgi-plata.jpg",
        "text": "Толук оку"
    },
    {
        "tema": "Информатикада процессор (борбордук процессор же процессор) маалыматты иштетүүнүн негизги операцияларын аткарган компьютердик системанын негизги компоненти болуп саналат. Бул программалык көрсөтмөлөрдү аткарууга жана маалыматтарды иштетүүгө жооптуу компьютердин мээси.",
        "name": "Процессор",
        "image": "processor",
        "text": "Толук оку"
    },
    {
        "tema": "Информатикада процессор (борбордук процессор же процессор) маалыматты иштетүүнүн негизги операцияларын аткарган компьютердик системанын негизги компоненти болуп саналат. Бул программалык көрсөтмөлөрдү аткарууга жана маалыматтарды иштетүүгө жооптуу компьютердин мээси",
        "name": "Процессор",
        "image": "processor",
        "text": "Толук оку"
    },
    {
        "tema": " Видеокарта (графикалык адаптер) – экранда графиканы иштетүү жана көрсөтүү үчүн жооптуу компьютердин компоненти. Ал компьютердин аналык платасына туташып, өзүнүн эс тутуму, процессору жана башка компоненттери бар",
        "name": "Видео карта",
        "image": "video-karta",
        "text": "Толук оку"
    },
    {
        "tema":
        "Random access memory (RAM) – компьютердин эс тутумунун бир түрү, ал процессор иштеп жаткан маалыматтарды жана программаларды убактылуу сактоо үчүн колдонулат. RAM маалыматтарга тез жетүүнү камсыз кылат жана процессорго маалыматты тез иштетүүгө мүмкүндүк берет. RAM компьютердин негизги компоненттеринин бири болуп саналат жана анын иштешинде маанилүү ролду ойнойт",
    "name": "Оперативдүү эс",
    "image": "operativdik-es",
    "text": "Толук оку"
    }
]