[
    {
        "id": 1,
        "title": "Европа өлкөлөрүнүн борбор шаарлары",
        "description": "Кымбаттуу окуучу! Биз жашап жаткан жер планетабыздагы Европа континентиндеги өлкөлөрдүн борбор шаарларын сизге тааныштырабыз.",
        "image": "assets/images/capitals/globe.png",
        "aboutManAndAnimal": [
            {
                "title": "Кишинин сүт эмүүчү жаныбарлар менен окшоштугу жана айырмачылыгы",
                "description1": "Биологиядагы адамдар менен сүт эмүүчүлөрдүн ортосундагы окшоштуктарды жана айырмачылыктарды ар кандай көз караштардан кароого болот. Бул жерде алардын айрымдары:",
                "description2": "1.Организмдин түзүлүшү жана функциялары:",
                "description3": "Окшоштуктар:",
                "description4": "Адамдар сыяктуу эле, сүт эмүүчүлөрдүн нерв, кан айлануу, дем алуу жана тамак сиңирүү системалары сыяктуу ар кандай системалардан турган татаал дене түзүлүшүнө ээ.",
                "description5": "Айырмасы:",
                "description6": "Адамдардын уникалдуу анатомиялык өзгөчөлүктөрү бар, мисалы, тик туруу, чоң мээнин өнүгүшү жана куралды колдонуу.",
                "description7": "2.Сүт берүү:",
                "description8": "Окшоштуктары:",
                "description9": "Башка сүт эмүүчүлөр сыяктуу эле, адамдар балдарын сүт бездери чыгарган сүт менен азыктандырышат.",
                "description10": "\nАйырмасы:",
                "description11": "Жеке адам бала эмизүү процессинин тегерегинде социалдык жана маданий аспектилерди иштеп чыккан, мисалы, бирге тамактандыруу жана узак мөөнөттүү үзгүлтүктүү эмчек эмизүү.",
                "description12": "Жеке адам бала эмизүү процессинин тегерегинде социалдык жана маданий аспектилерди иштеп чыккан, мисалы, бирге тамактандыруу жана узак мөөнөттүү үзгүлтүктүү эмчек эмизүү.",
                "description13": "3.Интеллект жана жүрүм-турум:",
                "description14": "Окшоштуктары:",
                "description15": "Сүт эмүүчүлөрдүн жана адамдардын өнүккөн нерв системасы бар, ал аларды курчап турган дүйнөнү үйрөнүү, эстеп калуу жана кабылдоо жөндөмүн камсыз кылат.",
                "description16": "\nАйырмасы:",
                "description17": "Адамда тил, маданият, абстракттуу ой жүгүртүү жана чыгармачылык сыяктуу өнүккөн интеллект жана татаал коомдук жүрүм-турум бар.",
                "description18": "4.Экология жана адаптациялар:",
                "description19": "\nАйырмасы:",
                "description20": "Адам өзүнүн жогорку деңгээлде өнүккөн интеллектинин жана технологиялык прогрессинин жардамы менен башка сүт эмүүчүлөргө караганда айлана-чөйрөнү алда канча көбүрөөк өзгөртүүгө жөндөмдүү. Адам жаңы экосистемаларды түзө алат, жаратылыш ресурстарын өзгөртө алат жана биологиялык ар түрдүүлүккө башка жаныбарларга таасир эте албайт.",
                "description21": "\nМаданий адаптациялар:",
                "description22": "\nАдам ошондой эле ар кандай экологиялык шарттарда аман калууга жана өнүгүүгө жардам берген технологияларды, социалдык структураларды, диний жана маданий практикаларды камтыган маданий адаптацияларды иштеп чыгууга жана берүүгө жөндөмдүү."
            }
        ]
    },
    {
        "id": 2,
        "title": "Америка кошмо штаттары",
        "description": "Кымбаттуу окуучу, биз жашап жаткан жер планетабыздагы Европа континентиндеги өлкөлөрдүн борбор шаарларын сизге тааныштырабыз.",
        "image": "assets/images/capitals/globe.png",
        "aboutKletka": [
            {
                "title": "Клетка",
                "description0": "Биологияда «клетка» термини тирүү организмдердин негизги структуралык жана функциялык бирдигин билдирет. Клетка бүт жандыктардын негизги курулуш материалы болуп саналат жана көптөгөн маанилүү кызматтарды аткарат. Бул жерде биологияда клетканын кээ бир негизги аспектилери болуп төмөндө көрсөтүлөт:",
                "description1": "1. Клетканын түзүлүшү:",
                "description2": "• Мембрана: клетканы курчап турган жана аны сырткы чөйрөдөн бөлүп турган жука кабыкча. Ал клетка менен айлана-чөйрөнүн ортосундагы заттардын жана маалыматтын агымын көзөмөлдөйт.",
                "description3": "\n• Цитоплазма: Гелеподобное вещество внутри клетки, заполняющее пространство между ядром и клеточной мембраной. В ней располагаются различные органеллы и молекулы.",
                "description4": "\n• Ядро: ДНК түрүндөгү генетикалык маалыматты камтыган клетканын башкаруу борбору. Ядро клетканын функцияларын башкарат жана клетканын бөлүнүшү учурунда генетикалык маалыматты өткөрөт.",
                "description5": "\n• Органеллалар: Цитоплазманын ичинде митохондрия (энергия өндүрүү үчүн жооптуу), эндоплазмалык ретикулум (белок синтезине катышат) жана Гольджи (молекулаларды иштетүү жана таңгактоо үчүн жооптуу) сыяктуу ар кандай адистештирилген органеллалар бар.",
                "description6": "2. Клетка функциялары:",
                "description7": "\n• Көбөйүү: Клеткалар бөлүнүү жолу менен көбөйүп, эки кыз клетканы пайда кылышат. Бул процесс митоз деп аталат жана организмдердин өсүп-өнүгүшүнүн негизи болуп саналат.",
                "description8": "\n• Метаболизм: Клеткалар айлана-чөйрө менен метаболизмди ишке ашырат, аш болумдуу заттарды соруп, зат алмашуунун калдыктарын сыртка чыгарышат.",
                "description9": "\n• Энергия өндүрүшү: кээ бир клеткалык органеллдер, мисалы, митохондриялар, клетка функцияларын аткаруу үчүн керектүү энергияны өндүрүшөт.",
                "description10": "\n• Протеин синтези: Клеткалар организмдин түзүлүшүндө жана иштешинде маанилүү роль ойногон ар кандай белокторду синтездейт."
            }
        ]
    },
    {
        "id": 3,
        "title": "Азия континенти",
        "description": "Азия Континенти жер шаарынын чыгыш тарабынан орун алган материк.",
        "image": "assets/images/capitals/globe.png",
        "aboutNervous": [
            {
                "title": "Нерв системасы",
                "description0": "Нерв системасы – сигналдарды берүүчү жана организмдин ишин координациялоочу түзүлүштөрдүн жана органдардын татаал тармагы. Ал дененин бардык функцияларын, анын ичинде кыймылды, кабылдоону, ой жүгүртүүнү, эс тутумду, эмоцияларды жана башка көптөгөн процесстерди жөнгө салууда жана көзөмөлдөөдө негизги ролду ойнойт.",
                "description1": "Нерв системасы эки негизги компоненттен турат: борбордук нерв системасы (БНС) жана перифериялык нерв системасы (ПНС).",
                "description2": "1. Борбордук нерв системасы (CNS): мээ жана жүлүн камтыйт. Мээ баш сөөктө жайгашкан жана дененин булчуңдарды координациялоо, эс тутум, ой жүгүртүү, сезим жана жүрүм-турум сыяктуу негизги функцияларын башкарат. Жүлүн жүлүн каналынын ичинде өтөт жана мээ менен дененин калган бөлүгүнүн ортосунда сигналдарды өткөрүү үчүн жооптуу.",
                "description3": "2. Перифериялык нерв системасы (PNS): мээден жана жүлүндөн чыккан жана бүт денени кыдырган бардык нервдерди камтыйт. PNS соматикалык жана вегетативдик нерв системаларына бөлүнөт.",
                "description4": "\n• Соматикалык нерв системасы аң-сезимдүү кыймылдарды жана кабылдагычтардан (мисалы, көз, кулак, тери) борбордук нерв системасына маалымат берүүнү башкарат.",
                "description5": "\n• Вегетативдик нерв системасы жүрөктүн согушу, дем алуу, тамак сиңирүү жана бөлүп чыгаруу сыяктуу организмдин автоматтык функцияларын жөнгө салат. Ал андан ары симпатикалык жана парасимпатикалык системаларга бөлүнөт, алар организмде тең салмактуулукту сактоо үчүн өз ара аракеттенишет.",
                "description6": "Нерв системасынын функцияларына нерв импульстарын берүү, кыймылдарды координациялоо, маалыматты иштетүү, органдардын жана системалардын ишин жөнгө салуу, эмоцияларды жана эс тутумду колдоо, ошондой эле мейкиндикте тең салмактуулукту жана багытты башкаруу кирет.Нерв системасы организм менен айлана-чөйрөнүн ортосундагы байланышты камсыз кылууда негизги ролду ойноп, кабылдоого мүмкүндүк берет"
            }
        ]
    },
    {
        "id": 4,
        "title": "Борбор шаарлар",
        "description": "Кымбаттуу окуучу, биз жашап жаткан жер плантетабыздагы ар бир өлкөнүн борбор шаарларын сизге тааныштырабыз.",
        "image": "assets/images/capitals/globe.png",
        "aboutBrain": [
            {
                "title": "Мээ",
                "description0": "Мээ адамдардын жана башка көптөгөн жаныбарлардын борбордук нерв системасынын эң татаал жана маанилүү органы болуп саналат. Ал маалыматты иштеп чыгуу, жүрүм-турумун көзөмөлдөө, кыймылды координациялоо жана дененин маанилүү функцияларын колдоо менен байланышкан көптөгөн функцияларды аткарат. Бул жерде мээнин кээ бир негизги аспектилери болуп саналат:",
                "description1": "1.Мээ анатомиясы:",
                "description2": "Баш мээ:",
                "description3": "\nМээче:",
                "description4": "Бул эки жарым шардан турган мээнин эң чоң бөлүгү. Ар бир жарым шар ар кандай функцияларды аткаруу үчүн адистештирилген бир нече маңдай, убактылуу, париеталдык жана желке бөлүктөргө бөлүнөт.",
                "description5": "Ал мээнин арткы бөлүгүндө жайгашкан жана координация, тең салмактуулук жана булчуңдарды башкаруу үчүн жооптуу.",
                "description6": "\nОртоңку мээ:",
                "description7": "Аң-сезимди, сергектикти жана стимулдарды баамдоону жөнгө салууда роль ойногон торчо формацияны камтыйт.",
                "description8": "\nАралык мээ:",
                "description9": "Гипоталамус жана таламус кирет, алар ички органдарды, эмоцияларды жана ар кандай дүүлүктүрүүчүлөргө реакцияларды жөнгө салууга катышат.",
                "description10": "\nАрткы мээ:",
                "description11": "Мээ менен жүлүндүн ортосунда сигналдарды өткөрүүдө, ошондой эле дем алуу жана жүрөктүн согушу сыяктуу негизги маанилүү функцияларды башкарууда роль ойногон medulla oblongata жана pons кирет.",
                "description12": "2.Мээнин функциялары:",
                "description13": "Когнитивдик функциялар:",
                "description14": "Мээ маалыматты иштетүү, эс тутум, ой жүгүртүү, кабылдоо, сүйлөө жана маселелерди чечүү үчүн жооптуу.",
                "description15": "\nКыймылды башкаруу:",
                "description16": "Мээ ылдамдык, күч жана тактык сыяктуу ар кандай кыймылдарды аткаруу үчүн булчуңдарды координациялайт жана башкарат.",
                "description17": "\nОрганды жөнгө салуу:",
                "description18": "Эмоциялар жана жүрүм-турум: Мээ бир нече механизмдер аркылуу эмоцияларды жөнгө салууга жана жүрүм-турумду калыптандырууга катышат."
            }
        ]
    }
]