[
    {
        "id": 1,
        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/icons8-history.gif?raw=true",
        "title": "Немис королдугунун жаралышы",
        "description": "Немис королдугунун жаралышы тууралуу билип алыңыз.",
        "aboutGermans": [
            {
                "title": "Немис королдугу",
                "description": "Германиянын королдугу (Германия деп да аталат) ар кайсы мезгилде Европанын тарыхында маанилүү роль ойногон. 5-10-кылымдардын шартында Германия королдугу жөнүндө бирдиктүү жана борборлоштурулган мамлекет катары айтуу бир аз кыйын. Анын ордуна, ар кандай герман уруулары жана варвар уруулары азыркы Германияны жана коңшу аймактарды ээлеп турган мезгил болгон.\n\n5-10-кылымдарда Германия көптөгөн майда мамлекеттерге, анын ичинде франк, саксон, тюринг, алеман жана башка урууларга бөлүнгөн. Алардын өз башкаруучулары жана герцог жана графтар сыяктуу башкаруу формалары болгон. Бул мамлекеттер аймактык артыкчылык жана саясий таасир үчүн бири-бири менен тынымсыз кагылышууларды жана согуштарды жүргүзүп турушкан.\n\nБирок, IX-кылымда саксон падышаларынын династиясы пайда болгондугун белгилей кетүү маанилүү, ал кандайдыр бир деңгээлде германдык биримдикке жана борборлоштурууга жетише алган. Бул династиянын эң атактуу падышаларынын бири 10-кылымда Ыйык Рим императорунун таажысын кийген Отто I болгон. Бул окуя Германиянын тарыхы үчүн чоң мааниге ээ болгон, анткени Германиянын падышалыгы азыр Борбордук жана Батыш Европанын көпчүлүк бөлүгүн камтыган кубаттуу империянын курамына кирген.\n\nБул мезгилде Германиянын королдугу да маданий жана интеллектуалдык өнүгүүнүн борбору болуп калды. Көптөгөн монастырлар түптөлүп, аларда билим, искусство жана адабият өнүккөн. Майнцтагы монастырь жазуу жана маданият түзүлгөн жана жайылтылган өзгөчө маанилүү борбор болуп калды.\n\nОшентип, V-X-кылымдарда герман падышалыгы бытыранды жана көп кырдуу мамлекет болгон, анын ичинде ар кандай герман уруулары жана варвар уруулары болгон. Бул бийлик, аймак жана ресурстар үчүн ар кандай мамлекеттер менен уруулардын ортосунда тынымсыз кагылышуулардын жана согуштардын мезгили болгон.\n\nБирок, чачыранды болгонуна карабастан, Германия падышалыгы өзүнүн маданий жана социалдык өзгөчөлүктөрүнө ээ болгон. Герман урууларынын өз каада-салттары, үрп-адаттары жана тилдери болгон. Варвар урууларынын маданияты бир топ примитивдүү болуп, аскер өнөрүнө, аңчылыкка жана койчулукка негизделген. Алар көптөгөн кудайларга ишенип, ар кандай ырым-жырымдарды, ырым-жырымдарды жасашкан.\n\nУбакыттын өтүшү менен христиандыктын таасири Германиянын падышачылыгына кире баштаган. Ыйык Бонифас сыяктуу миссионерлер герман урууларынын арасында христиан динин жайылтуу үчүн бул жерлерге келишкен. Бул христиандыктын акырындык менен кабыл алынышына жана Германияда христиан маданиятынын жана чиркөөсүнүн калыптанышына алып келген.\n\nГермания королдугунун тарыхындагы маанилүү окуя 10-кылымда биринчи Ыйык Рим императору болгон Оттон I башкаруусу астында биригүү болгон. Бул окуя Германия королдугунун башкаруунун императордук формасына өткөнүн белгилеп, Германияны Борбордук жана Батыш Европадагы алдыңкы держава катары негиздеген.\n\nБирок, саясий жана маданий ишмердүүлүк менен бирге Италия да ички кагылышуулардан, согуштардан жана кол салуулардан жапа чеккен. Шаарлар менен мамлекеттердин ортосундагы тынымсыз чыр-чатактар, чет элдик аскерлердин жана баскындардын таасири аймактын биримдигин жана туруктуулугун алсыраткан.\n\nОшентип, V-X-кылымдардагы Германия падышалыгы саясий бытырандылык доору болгон менен бирге Германиянын маданиятына жана тарыхына олуттуу таасирин тийгизген. Улуу Германиянын падышалары жана императорлору тарыхта из калтырышкан жана алардын таасири бүгүнкү күнгө чейин уланууда."
            }
        ]
    },
    {
        "id": 2,
        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/icons8-history.gif?raw=true",
        "title": "Рим Империясы",
        "description": "Тарыхта Рим Империясы жөнүндө таанышыңыз.",
        "aboutRoma": [
            {
                "title": "Рим империясы",
                "description": "Рим империясы - биздин заманга чейинки 27-жылдан бери жашап келе жаткан байыркы мамлекет. 476-жылга чейин Бул тарыхтагы эң маанилүү жана таасирдүү мамлекеттердин бири болгон.\n\nРим империясы биринчи Рим императору болуп, «Август» титулуна ээ болгон Октавиан Август менен башталган. Өзүнүн гүлдөп турган мезгилинде Рим империясы кеңири аймактарды, анын ичинде Европанын, Түндүк Африканын жана Жакынкы Чыгыштын бир бөлүгүн камтыган.\n\nИмперия жакшы уюшулган жана өнүккөн башкаруу системасы болгон. Ал жолдорду, акведуктарды, амфитеатрларды жана башка укмуштуудай архитектуралык курулуштарды курган. Рим империясы өзүнүн мыйзамдары, инфраструктурасы, инженердик жетишкендиктери жана маданий мурастары менен белгилүү болгон.\n\nРим империясынын аскердик күчү анын гүлдөп-өсүшүндө жана кеңейүүсүндө негизги ролду ойногон. Рим армиясы тарыхтагы эң тартиптүү жана уюшкан аскерлердин бири болгон жана ал жаңы аймактарды ийгиликтүү басып алып, империянын чек арасын кеңейткен.\n\nБирок Рим империясы өзүнүн жашоосунун акыркы кылымдарында ар кандай көйгөйлөргө туш болгон. Ички чыр-чатактар, саясий интригалар, экономикалык кыйынчылыктар жана варвар урууларынын чабуулдары империяны алсыраткан. Акыр-аягы, Рим империясынын батыш бөлүгү 476-жылы варварлар тарабынан басып алынган, бул Батышта Рим империясынын аяктаганын белгилеген.\n\nБирок Рим империясынын мураскору болгон Византия империясы чыгышта жашоосун улантып, 1453-жылга чейин анын борбору Константинополду Осмон империясы басып алганга чейин күчүндө болгон.\n\nРим империясы укук, саясат, архитектура, адабият жана маданият тармактарында олуттуу мурас калтырган. Анын «Рим укугу» деп аталган укук системасы азыркы европалык укуктун негизги негиздеринин бири болгон жана дүйнө жүзү боюнча көптөгөн укук системаларынын өнүгүшүнө таасирин тийгизген.\n\nРим архитектурасы Колизей, Пантеон, Рим форуму жана Каракалла мончолору сыяктуу улуу курулуштары менен белгилүү. Педиментти жана улуу мамычаларды таажы кылган арка сымал конструкцияларды колдонуу Рим архитектурасына мүнөздүү болуп, келечектеги доорлордун архитектурасына олуттуу таасирин тийгизген.\n\nРим доорунун адабияты да Батыш маданиятына маанилүү таасирин тийгизген. Цицерон, Вирджил, Овид, Тацит сыяктуу улуу Рим жазуучулары тарыхты, философияны, поэзияны жана риториканы изилдөө үчүн азыркыга чейин маанилүү болгон чыгармаларды жаратышкан.\n\nРим империясынын саясий уюму, анын ичинде «император» түшүнүгү жана провинцияларга бөлүнүшү келечектеги империяларга жана мамлекеттерге таасирин тийгизген. Римдиктер иштеп чыккан башкаруунун идеялары, жарандык принциптери жана салык салуу системалары узак мөөнөттүү мааниге ээ болгон."
            }
        ]
    },
    {
        "id": 3,
        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/icons8-history.gif?raw=true",
        "title": "Байыркы германдыктар",
        "description": "Кымбаттуу окуучу, байыркы германдыктар тууралуу окуп билиңиз.",
        "aboutOldGermans": [
            {
                "title": "Байыркы немистер",
                "description": "Байыркы немистер биздин заманга чейинки 2-миң жылдыкта Түндүк Европада жашаган уруулардын жана элдердин тобу болгон. 5-кылымына чейин Алар индоевропа элдеринин чоң тобуна кирген жана готтар, франктар, саксондор жана бурчтар сыяктуу башка герман уруулары менен тууган болгон.\n\nБайыркы немистер ар кандай аймактарда, анын ичинде азыркы Германияда, Голландияда, Данияда, Швецияда, Норвегияда жашашкан. Алардын жашоо образы, маданияты жаратылыш жана аскердик жашоо образы менен тыгыз байланышта болгон.\n\nАлар согушчан элдер катары белгилүү болгон жана көп учурда башка уруулар жана Рим империясы менен кагылышууларга катышкан. Римдиктер менен болгон белгилүү жолугушуулардын кээ бирлери Тевтобург токоюндагы салгылашууну (б.з. 9) камтыйт, анда немис лидери Арминиус Рим генералы Публий Квинтилий Варусту жеңип, Римдин Германияны басып алышына жол бербейт.\n\nБайыркы немистерде уруучулук түзүлүштүн өнүккөн системасы болгон, мында ар бир уруунун өзүнүн лидери жана өзүнүн коомдук-саясий түзүлүшү болгон. Алар майда конуштарда жашап, экономикасы негизинен дыйканчылыкка, малчылыкка жана кол өнөрчүлүккө негизделген.\n\nМаданий жактан немистер жаратылыштын жана жашоонун ар кандай аспектилерин чагылдырган ар кандай кудайларга ишенишкен. Алардын диний ишенимдери, ырым-жырымдары жаратылыш кубулуштары жана ата-бабаларга сыйынуу менен тыгыз байланышта болгон.\n\nБиздин замандын v-кылымында. Батыш Рим империясынын аймагына герман уруулары кол сала баштаган, бул империянын кулашына жана Европада орто кылымдын башталышына алып келген. Кээ бир герман уруулары, мисалы, франктар мурдагы Рим империясынын аймагында өз мамлекеттерин түзө башташкан.Жаңы мамлекеттердин жана коомдук түзүлүштөрдүн түзүлүшүндө герман уруулары, өзгөчө франктар маанилүү роль ойногон. Франктар күчтүү герцогдукту, андан кийин падышалыкты түзүп, Каролинг династиясынын жана акыры Ыйык Рим империясынын пайда болушуна негиз болгон.\n\nБелгилей кетчү нерсе, герман уруулары да жаңы түзүлгөн мамлекеттерге өздөрүнүн маданий салымдарын алып келишкен. Бул тил, мыйзам системасы, коомдук үрп-адаттар жана динди камтыйт. Кошумчалай кетсек, немис лидерлери жана элиталары жаңы мамлекеттик структуралардын бир бөлүгү болуп, бул мамлекеттердин саясий жана маданий өзгөчөлүгүн калыптандырууда маанилүү роль ойношкон.\n\nОрто кылымдын кийинки мезгилдеринде герман уруулары да рыцарлык маданияттын калыптанышында жана крест жортуулдарына катышууда роль ойногон. Алардын таасири Түндүк Европанын чегинен да ашып кеткен.\n\nБугунку күндө герман элдери Германиянын жана Европанын башка өлкөлөрүнүн улуттук-этникалык түзүлүшүнүн негизин түзөт. Герман тили, маданияты жана үрп-адаттары байыркы немистердин тарыхында терең тамырлашкан.\n\nОшентип, байыркы немистер Европанын тарыхында маанилүү роль ойноп, түрдүү коомдордун жана мамлекеттердин саясий, социалдык, маданий жана диний аспектилерине таасирин тийгизген. Алардын согуштук духу, уруулук уюмдашуусу жана маданий салттары азыркы Европа коомунун тарыхында жана калыптанышында өзүнүн изин калтырган."
            }
        ]
    },
    {
        "id": 4,
        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/icons8-history.gif?raw=true",
        "title": "Италия V-X кылымдарда",
        "description": "Кымбаттуу окуучу, байыркы Италиянын өзгөчөлүктөрү тууралуу сизге тааныштырабыз.",
        "aboutOldItalia": [
            {
                "title": "Италия V-X кылым аралыгы",
                "description": "V-X-кылымдардын аралыгында Италияда анын тарыхына жана маданиятына чоң таасирин тийгизген олуттуу саясий жана социалдык өзгөрүүлөр болгон.\n\nБул мезгилдин башында Италия көптөгөн майда мамлекеттерге жана аймактарга, анын ичинде Острогот жана Византия королдугуна, ошондой эле Ломбард королдугуна бөлүнгөн. Бул мамлекеттер Италиянын аймагын көзөмөлдөө үчүн күрөшкөн, бул көптөгөн чыр-чатактар ​​менен согуштарга алып келген.\n\nБирок VIII-кылымда Карл деген ат менен белгилүү болгон франк королу Карл Италиянын көпчүлүк бөлүгүн басып алып, аны өз бийлигине бириктирген. Ал Каролинг империясын түзүп, ал азыркы Италияга, Францияга, Германияга жана башка коңшу өлкөлөргө жайылган.\n\nИталияда Улуу Карлдын бийлиги тушунда борбордук бийлик чыңдалып, франк административдик системасы киргизилген. Ал билим берүү, сот жана чиркөө уюмунда реформаларды жүргүзгөн. Карл ошондой эле ордосуна окумуштууларды жана сүрөтчүлөрдү тартып, маданият менен билим берүүнүн өнүгүшүнө дем берген.\n\nУлуу Карл өлгөндөн кийин, империя бытырандылык жана ички чыр-чатактар ​​көйгөйлөрүнө туш болгон. IX-кылымда Италия ар кандай феодалдык башкаруучулар менен Тоскана марграттары жана Сполетонун графтары сыяктуу күчтүү үй-бүлөлөрдүн ортосундагы күрөштүн сахнасына айланган.\n\nX-кылымда Италиядагы абал Сарацендердин басып кириши жана Ыйык Рим империясынын таасири менен ого бетер татаалдашкан. Флоренция, Венеция, Генуя сыяктуу шаар-мамлекеттер аймактын саясий жана экономикалык турмушунда маанилүү роль ойной баштаган.\n\nИталиянын тарыхындагы бул мезгил италиялык маданияттын гүлдөп-өнүгүшү менен да мүнөздөлгөн. Флоренция, Пиза жана Сиена сыяктуу улуу шаар-мамлекеттер Ренессанс искусствосунун, архитектурасынын жана илиминин борборлоруна айланган. Байыркы маданиятка жана классикалык мураска болгон кызыгуунун жанданышы улуу сүрөтчүлөрдүн, философтордун жана илимпоздордун чыгышына алып келди.\n\nИталия ошондой эле Чыгыш менен Батышты байланыштырган маанилүү соода борбору болгон. Венеция жана Генуя сыяктуу соода шаарлары соода тармактарын жана таасирин кеңейтип, деңиз соодасынын бай жана гүлдөгөн борборлоруна айланган.\n\nБирок, саясий жана маданий ишмердүүлүк менен бирге Италия да ички кагылышуулардан, согуштардан жана кол салуулардан жапа чеккен. Шаарлар менен мамлекеттердин ортосундагы тынымсыз чыр-чатактар, чет элдик аскерлердин жана баскындардын таасири аймактын биримдигин жана туруктуулугун алсыраткан.\n\nX-кылымдын аягында Италия ар кандай башкаруучулар менен мамлекеттердин, анын ичинде Түштүк Италиянын Норман Королдугу менен Сицилиянын, Папа мамлекеттеринин жана Германиянын императорлорунун ортосундагы күрөштүн сахнасына айланган. Бул Италиянын андан ары бытыранды болушуна, шаар мамлекеттеринин жана коммуналардын ролунун күчөшүнө алып келди.\n\nОшентип, Италия 5-10-кылымдарда саясий өзгөрүү, кагылышуу жана маданий өнүгүү мезгилин башынан өткөргөн. Ал чирип бараткан империяга айланып, көптөгөн мамлекеттерге бөлүнүп, ошол эле учурда маданий гүлдөп-өнүгүүнүн, таасирдин жана сооданын борборуна айланган. Бул мезгил Италиянын тарыхынын жана маданиятынын калыптанышына, ошондой эле анын Европадагы келечектеги ролуна олуттуу таасирин тийгизген."
            }
        ]
    }
]