[
    {
        "one": [
            {
                "title": "Компьютердин негизги бөлүктөрү жана алардын функциялары",
                "description": "Компьютер деген эмне жана анын функцияларын окуп үйрөнүңүз",
                "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/capitals/globe.png",
                "computerParts": [
                    {
                        "tema": "Негизги плата – бул компьютердин ичиндеги негизги басма схемасы, анда компьютер системасынын ар кандай компоненттери жана түзүлүштөрү жайгаштырылган жана бири-бири менен иштешет. Бул процессор, оперативдүү эс, видеокарта, катуу диск жана башка түзүлүштөрдүн ортосундагы байланышты жана өз ара аракеттенүүнү камсыз кылган борбордук элемент.",
                        "name": "Негизги плата",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/nagizgi-plata.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Информатикада процессор (борбордук процессор же процессор) маалыматты иштетүүнүн негизги операцияларын аткарган компьютердик системанын негизги компоненти болуп саналат. Бул программалык көрсөтмөлөрдү аткарууга жана маалыматтарды иштетүүгө жооптуу компьютердин мээси.",
                        "name": "Процессор",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/processor.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Информатикада процессор (борбордук процессор же процессор) маалыматты иштетүүнүн негизги операцияларын аткарган компьютердик системанын негизги компоненти болуп саналат. Бул программалык көрсөтмөлөрдү аткарууга жана маалыматтарды иштетүүгө жооптуу компьютердин мээси",
                        "name": "Процессор",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/processor.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": " Видеокарта (графикалык адаптер) – экранда графиканы иштетүү жана көрсөтүү үчүн жооптуу компьютердин компоненти. Ал компьютердин аналык платасына туташып, өзүнүн эс тутуму, процессору жана башка компоненттери бар",
                        "name": "Видео карта",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/video-karta.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Random access memory (RAM) – компьютердин эс тутумунун бир түрү, ал процессор иштеп жаткан маалыматтарды жана программаларды убактылуу сактоо үчүн колдонулат. RAM маалыматтарга тез жетүүнү камсыз кылат жана процессорго маалыматты тез иштетүүгө мүмкүндүк берет. RAM компьютердин негизги компоненттеринин бири болуп саналат жана анын иштешинде маанилүү ролду ойнойт",
                        "name": "Оперативдүү эс",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/operativdik-es.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Катуу диск (HDD) жана катуу абалдагы диск (SSD) компьютерлерде жана башка түзмөктөрдө маалыматтарды сактоонун эки башка түрү.\nHDD айлануучу магниттик дисктерден турат, аларда маалыматтар жазылган жана окуу баштары аркылуу окулат. Маалыматтарды алууда баштар дисктерди айланып өтөт, бул бир аз убакытты талап кылат. Бул HDD маалыматтарына кирүү убакыты адатта жогору экенин жана окуу жана жазуу ылдамдыгы дисктин айлануусу жана баштын кыймылы менен чектелет дегенди билдирет.\nSSD, экинчи жагынан, маалыматтарды сактоо үчүн флеш эстутумду колдонот. Анын кыймылдуу бөлүктөрү жок, бул маалыматка тезирээк жетүүнү камсыз кылат. SSDде маалымат чиптерде сакталат жана аны бир эле учурда бир нече жерден окууга жана жазууга болот, натыйжада маалыматтарды берүүнүн жогорку ылдамдыгы жана кирүү убакыттары аз болот",
                        "name": "HDD-SSD дисктер",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/hdd-ssd.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Оптикалык диск катары да белгилүү болгон диск, оптикалык дисктерден маалыматтарды окуу жана жазуу үчүн түзүлүш. Ал компакт дисктер (CD), DVD жана Blu-ray дисктери менен иштөө үчүн колдонулат. Диск дисктери компьютерлерде жана ноутбуктарда кеңири таралган, бирок алар акыркы жылдары санариптик сактоо форматтарынын өнүгүшүнө жана кээ бир түзүлүштөрдөгү дисктерди алып салууга байланыштуу азыраак популярдуу болуп калды",
                        "name": "Дисковод",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/cd-dvd-rom.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Үн картасы, ошондой эле аудио карта же үн адаптери катары белгилүү, аудио сигналдарды иштетүүчү компьютердик түзүлүш. Ал үндү ойнотууга, үн жаздырууга, аудио маалыматтарды иштетүүгө жана компьютерге динамиктер, гарнитуралар, микрофондор жана башкалар сыяктуу аудио түзүлүштөр менен байланышуу үчүн арналган",
                        "name": "Үн картасы",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/sound-card.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Жылуулук салгыч желдеткич (ошондой эле муздаткыч же муздаткыч желдеткич деп да аталат) компьютер системаларында жылуулук раковиналарын активдүү муздатуу үчүн колдонулган компонент. Ал радиатордон ашыкча жылуулукту кетирүүчү аба агымын камсыздайт жана процессорлор жана графикалык карталар сыяктуу компоненттердин оптималдуу температурада иштешине жардам берет",
                        "name": "Желдеткич радиатору менен",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/cooler.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": " Компьютердик энергия менен жабдуу бирдиги (PSU) - компьютер системасынын бардык компоненттерин иштетүү үчүн электр энергиясы менен камсыз кылуучу түзүлүш. Ал электр энергиясын AC тармагындагы чыңалуудан түз чыңалууга (DC) айлантат, ал компьютердин компоненттерин кубаттоо үчүн зарыл",
                        "name": "Компютердин кубат алуучу блогу",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/power-supplies.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Компьютердин корпусу, ошондой эле система корпусу же шасси деп аталат, бул компьютердин ички компоненттерин камтыган жана коргогон тышкы кабык. Бул энелик плата, процессор, видеокарта, катуу дисктер, электр менен жабдуу жана башка компоненттер орнотулган металл же пластик түзүлүш",
                        "name": "Компьютердик кейс",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/computer-case.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Перифериялык түзүлүш: Монитор – компьютер системасынын визуалдык маалыматын көрсөтүүчү чыгаруучу түзүлүш. Бул колдонуучунун компьютер менен визуалдык өз ара аракеттенүүсүнүн негизги интерфейси жана текстти, сүрөттөрдү, видеолорду жана башка графикалык элементтерди көрсөтөт",
                        "name": "Монитор",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/monitor.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Перифериялык түзүлүштөр: Клавиатура – ​​колдонуучуга текстти, буйруктарды жана башка маалыматты компьютерге же башка түзүлүшкө киргизүүгө мүмкүндүк берүүчү киргизүү түзүлүш. Ал тамгаларга, сандарга, символдорго жана функциялык буйруктарга туура келген баскычтардын жыйындысынан турат",
                        "name": "Клавиатура",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/keyboard.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Перифериялык түзүлүштөр: Чычкан – бул колдонуучуга компьютер экранындагы көрсөткүчтү башкарууга жана тандоо, кыймыл жана чыкылдатуу(басуу) сыяктуу ар кандай аракеттерди жасоого мүмкүндүк берүүчү киргизүү түзүлүш. Бул Иш столдун бетинде же килемде жылдырыла турган кичинекей түзүлүш жана анын бир же бир нече баскычы бар",
                        "name": "Компьютердик чычкан",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/pc-mouse.jpg",
                        "text": "Толук оку"
                    },
                    {
                        "tema": "Перифериялык түзүлүштөр: Динамиктер, ошондой эле динамиктер же катуу сүйлөгүчтөр катары белгилүү, үн чыгаруучу түзүлүштөр. Алар компьютерден же башка аудио булактардан музыка, сүйлөө жана үн эффекттери сыяктуу аудио сигналдарды ойнотуу үчүн иштелип чыккан",
                        "name": "Үн колонкалар",
                        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/informatica/computer_structures/pc-speakers.jpg",
                        "text": "Толук оку"
                    }
                ]
            }
        ]
    },
    {
        "title": "Персонал компьютер",
        "description": "Кымбаттуу окуучу, Персонал компьютер тууралуу окуп билиңиз",
        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/capitals/globe.png"
    },
    {
        "title": "Компьютердик тармактар",
        "description": "Кымбаттуу окуучу, компьютердин тармактары менен таанышыңыз",
        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/capitals/globe.png"
    },
    {
        "title": "Системалык программалык камсыздоо",
        "description": "Системалык программалык камсыздоо тууралуу окуңуз",
        "image": "https://github.com/adilbek-hub/FLUTTER2023/blob/main/education/images/capitals/globe.png"
    }
]